
    /*


جواب السؤال الاول:لايمكن لواجهتين ان تمتدان بعضها البعض متبادله مباشره بسبب امكانيه حدوث الغموض والتضاربات
بدلا من ذلك يمكن استخدام الواجهات بالتزامن مع التوريث المتعدد لتوفير الوظائف لمطلوبه دون ادخال هذه المشاكل
#تسبب التوريث المتكرر


جواب السؤال الثاني:احد العيوب هي :_صعوبه فهم النظام وزياده التعقيد
_قد يؤدي تكرار الكود وتكرار الوظائف
_زياده الوقت المستغرق في عمليه البحث والوصول الى البيانات


جواب السؤال الثالث:العيوب:_زياده حجم الذاكره المستخدمه
_زياده في تكلفه الاستدعاءات الوظيفيه
_زياده في تعقيد الصيانه


جواب السؤال الرابع:
Read it
Box it
Buy it
Read it
Box it
Buy it











 */





